{
  "profile": {
    "name": "Alexander Shved",
    "email": "a.shved90@gmail.com",
    "social": {
      "email": "a.shved90@gmail.com",
      "github": "https://github.com/shved90",
      "linkedin": "https://www.linkedin.com/in/shved90/",
      "facebook": "https://www.facebook.com/100002157118009",
      "twitter": "https://twitter.com/Shved_90",
      "vkontakte": "https://vk.com/a.shved90",
      "skype": "skype:xel.naga74?add",
      "peopleperhour": "https://pph.me/shved"
    }
  },
  "jobs": [
    {
      "company": "fresh8Gaming (Connected Ventures)",
      "link": "http://fresh8gaming.com/",
      "logo": "logo",
      "location": "Bristol",
      "period": "November 2017 - Present",
      "role": "Front End Engineer",
      "summary": "A feature-rich role with many technologies across many levels. Vue based development, setting up docker servers, running bash scripts for SQL migrations, to building custom Vue component library.",
      "description": "I work with client team on a wide range of technologies to deliver innovative and flexible solutions to clients in gambling sector. I am responsible for development of widgets across wide selection of technologies and services, from visual side of things to functionality, frequently moving between FE and BE in order to set everything up and populate correctly, touching up on both SCSS and SQL, not shying away from bash scripts, using Invision, most of development is done using Vue and custom built Vue based platform"
    },
    {
      "company": "Element78 Solutions",
      "link": "https://www.element78.co.uk/",
      "logo": "logo",
      "location": "Bristol",
      "period": "March 2016 - May 2017",
      "role": "Middleweight Web Developer",
      "summary": "A mid-weight developer position in a well established full service digital agency with a goal to train and grow to a senior web developer and team lead role in the near future.",
      "description": "I work closely with Frontend and Backend teams to evaluate and improve current development cycle, research and present new technologies to the office to further optimize the development process and bring both teams closer together for a tighter collaboration and seamless integration of their work. Of course I still have a hand in front end web development, fleshing out designs and building a pleasant browsing experience across all media and devices, to a high code standard and with accessibility in mind. A broad selection of tools are used on a daily basis, Visual studio and Sublime are the IDEs of choice for our developers, TFS for version control and LESS/Handlebars mixture for quick and efficient BEM prototyping before merging a website with Umbraco/Sitecore functionality."
    },
    {
      "company": "Deep Blue Sky",
      "link": "https://deepbluesky.com/",
      "logo": "logo",
      "location": "Bath Spa",
      "period": "July 2015 - March 2016",
      "role": "Front End Web Developer",
      "summary": "Amazing place to work at, utmost attention to detail, great relationship with clients, full support from back end developers and always great care to deliver a website that everyone in the office can be proud to put their name on.",
      "description": [
        "My responsibilities include a full front end package – HTML, CSS (SASS) and JS (Vanilla, Jquery, Prototype), integrating designs into a PHP based back end system called <a href=\"https://deepbluesky.com/news/-/how-does-spirit-differ-from-a-traditional-cms-like-wordpress-256/\" target=\"_blank\" rel=\"noopener\">Spirit</a>, I interact with PHP on a regular basis and while I don’t write any from scratch I frequently interact with existing scripts, copying and editing when necessary, sometimes creating entire modules from existing pieces. After finalizing the project brief with the client, our UX designers build a framework that Digital Designers flesh out and create a full design from, including an asset sheet and interaction patterns, and sometimes reusable blocks too.",
        "Then Front end developers take it apart and build a fully responsive, cross browser tested, interactive and animated site. At the same time PHP developers build new modules for our bespoke CMS and prepare additional functionality for the site if required, ready to be merged with front end. After Spirit and front end code is merged and turned into a fully functional site UX and UI designers go over the whole process and make sure it flows just as intended, if not – additional revisions are added and the whole site is tweaked to be the best it can be.",
        "Versioning is done with Git and Codebase, most of which is managed through terminal, including SASS compiler and branch hierarchy."
      ]
    },
    {
      "company": "Code Change",
      "link": "https://www.codechange.co.uk/",
      "logo": "logo",
      "location": "Bradford-on-Avon",
      "period": "October 2013 - July 2015",
      "role": "Junior Front End Web Developer",
      "summary": "Management and maintenance of existing websites and completed projects. Front end development of new projects based on bespoke .NET shopping platforms",
      "description": [
        "CodeChange specialized in bespoke .NET Ecommerce and Elearning platforms. After client gathering requirements they are customized in accordance with the clients needs.",
        "Then or during this process a design was being established and passed on to front end team to be built on top of said platforms.",
        "My work involved the front end side of the process – turning a design into fully functional website, building on top of .NET functionality using partial views and master pages and linking all the functionality and generated data to the right places on design and making it interactive if needed.",
        "I was responsible for my own workload and time management, as well as negotiations with projects client during build and after submission, and passing the project on to another developer.",
        "Key technologies used were HTML, CSS and JS, focusing mainly on the first two, replacing any JS possible with CSS animations, checklist toggle nav menu would be an example. All the code was managed via Github versioning between all developers involved.",
        "JS and Jquery involved heavy use of third party plugins for sliders, slider zoom, fancyboxes, drop downs, browser caching, cookies etc."
      ]
    },
    {
      "company": "Saatchi & Saatchi Health",
      "link": "http://saatchi.co.uk/en-gb/",
      "logo": "logo",
      "location": "Manchester",
      "period": "September 2011 - August 2012",
      "role": "Trainee Web Developer",
      "summary": "Duties included HTML/CSS/JS website development according to designs supplied by in-house designer. Completed work was then uploaded and synced to TortoiseSVN and passed on to senior developers for review. Extra work consisted of CMS management.",
      "description": ""
    }
  ],
  "skills": [
    {
      "name": "HTML5",
      "logo": "html",
      "description": "I write clean semantic markup, and currently undergoing a crisis of minimalist vs OO approach that came from modern frameworks such as Vue."
    },
    {
      "name": "CSS3 + SASS",
      "logo": "css",
      "description": "My CSS3 includes anything and everything it can get a hold of, if it can be made in CSS - it will be, in a clean, minimalistic and consistent fashion. Unless JS is more appropriate of course."
    },
    {
      "name": "Device and Browser agnostic",
      "logo": "responsive",
      "description": "With mobile-first approach, I write fully responsive code, tested across multiple platforms before release."
    },
    {
      "name": "WAI & a11y accessible",
      "logo": "accessibility",
      "description": "My websites cater to various user disabilities, and ease of access through all kinds of media."
    },
    {
      "name": "JS (ES6+)",
      "logo": "javascript",
      "description": "Thoroughly linted, clear and easily reausable OOP approach."
    },
    {
      "name": "Vue/Vuex",
      "logo": "vue",
      "description": "I picked up Vue over a year ago thanks to my last workplace. It proved smooth and efficient at what it does, huge timesaver."
    },
    {
      "name": "React/Redux",
      "logo": "react",
      "description": "I experimented with react back when it was still new, as a small side project."
    },
    {
      "name": "SQL/PostgreSQL",
      "logo": "database",
      "description": "I've done a bit of SQL data management and shuffling tables around via node scripts."
    },
    {
      "name": ".NET, C#, Umbraco",
      "logo": "asp",
      "description": "By no means proficient, I've done minor MVC and back end work during my time with E78"
    },
    {
      "name": "PHP and Wordpress",
      "logo": "php",
      "description": "I have done a few tickets and freelance contracts on Wordpress, nothing major, but enough to get the basics right."
    },
    {
      "name": "Git",
      "logo": "github",
      "description": "Git is my primary versioning system of choice, either via github or gitbash or regular terminal. I also used TortoiseSVN way back in the day. And BitBucket for a few freelance projects thanks to its free private repos."
    }
  ],
  "education": [
    {
      "institution": "Gloucestershire University",
      "link": "http://www.glos.ac.uk",
      "logo": "logo",
      "location": "Cheltenham",
      "period": "2009 - 2013",
      "degree": "Bachelor of Technology (2.1 Honours)",
      "modules": [
        "Cisco networking",
        "Website development",
        "Web design",
        "Database design",
        "Java development"
      ],
      "description": "Dissertation Topic of choice: How current Web Technologies allow SMEs to compete with larger competitors in the context of mobile content delivery and service provision"
    },
    {
      "institution": "Bournemouth & Poole College",
      "link": "https://www.thecollege.co.uk/",
      "logo": "logo",
      "location": "Bournemouth",
      "period": "2006 - 2009",
      "degree": "NVQ Lv2 and BTEC Lv3 in IT",
      "modules": "",
      "description": "Double Distinction graduation award in such course modules as Web Design and Development, Database Management, and E-Commerce."
    }
  ],
  "portfolio": [
    {
      "title": "fresh8gaming",
      "link": "http://fresh8gaming.com/",
      "logo": "f8ads",
      "summary": "Custom built pattern library using atomic design principles. Heavy reliance on flexbox for dynamic element sizing, immense flexibility in switching out atoms in molecules for a fully dynamic ad. Built with Vuejs, this allows for any client brand coating to come from CMS, as well as atom/molecule configuration.",
      "description": [
        "Core feature of the ads was the ability to edit their content on the fly from CMS and see the results reflecting live within seconds.",
        "Originally, ads were built from a standard set of templates that were manually styled and tweaked based on client approved designs. This was a fairly straightforward but tedious process as both HTML and CSS were changing from ad to ad, requiring full testing coverage every time, including IE10+. Data was primarily server through a monolithic PostgreSQL database that required constant manual updates to setup the end product. There were also services like localization, classifier, and CMS. Each of them required their own individual setup for a new client.",
        "One of the key goals for the rebuild was to simplify the rollout, cut down on code/testing/release time, essentially giving the product away to designers to be able to do the whole rollout from start to finish without involving developers.",
        "We overhauled the entire front end and moved to Vuejs. We chose atomic design for our upcoming pattern library, breaking down our extensive ad building experience into key components that were the building blocks of new ads. Atoms were the smallest bits of data - indicators, logos, buttons, list items etc. And those were the building blocks of our molecule components, headers, footers, and main content blocks of the ads. The highlight of this was the exceedingly dynamic setup where each group of molecules could fit inside any ad size and consistently look good, thanks to flexbox styling.",
        "Meanwhile backend was being segmented and broken up from a single monolithic database into a collection of microserices segmented in Docker components. A series of node scripts were added to generate folder structure and initial presets for new client build, which automated a huge amount of overhead. A lot of database migrations, and overwhelming amount of individual updates and datapoint creation for new clients were eliminated and grouped up into either scripts or linked services.",
        "In the end, we cut our delivery time by almost 80%, coming down from over a month, to barely a week. It was a huge success."
      ]
    },
    {
      "title": "Element78",
      "link": "https://www.element78.co.uk/",
      "logo": "element78",
      "summary": "Original site was built with a rigid and - at the time - glitchy <a href=\"https://github.com/wycats/handlebars.js/\" target=\"_blank\" rel=\"noopener\">handlebars</a> and <a href=\"http://mustache.github.io/mustache.5.html\" target=\"_blank\" rel=\"noopener\">mustache</a> templating framework, with data coming from JSON. New site was rebuild with an in-house pattern library called Alloy, and using Umbraco CMS and .NET backend for dynamic data.",
      "description": [
        "I had the honors of rebuilding the entire website as my first project as a new Middleweight developer at E78.",
        "Rebuild involved a close collaboration with back end team to create and setup Umbraco, plan out necessary  input fields and data we want to show, and expose all the hooks for front end work",
        "Once the planning and prototyping was done, and BE was being setup, I started working on FE. First thing was to familiarize myself with existing templating system, and while experimenting with it I found it limited and clunky, syntax and nesting had some bugs I had to work around. Then there was Alloy, a fully bespoke in-house styling library which I extended a little to include edge cases I found I needed for the rebuild and additional design layouts.",
        "Once I did the basic setup on FE side, it was time to merge it with BE hooks and see the glorious half-styled data. This was also my first time adding <a href=\"https://schema.org/\" target=\"_blank\" rel=\"noopener\">Schema.org</a> to the site. Alloy also had a lot of interactive elements such as sliders and accordions built in. In retrospect it was an in-house version of modern frameworks such as React and Vuejs.",
        "A few weeks later Alloy and Umbraco were fully hooked together it was a simple cleanup to make sure its all running smoothly. Checking Umbraco UX side of things, iron out the kinks in how the data gets passed, optimize when necessary, rework when required.",
        "The whole project, including learning time and optimization took almost two months, and in the end we had a brand new shiny website that looked almost identical to the old one, but was infinitely more reusable, much easier to update, flexible and a clean code to be proud of."
      ]
    },
    {
      "title": "Squashskills",
      "link": "https://squashskills.com/",
      "logo": "squashskills",
      "summary": "A step removed from a full-on single page application. A huge portal rich with features, from blogs to videos, with calendars and excersise planner and workout breakdown. This was built using jQuery and PHP-based in-house CMS called <a href=\"https://deepbluesky.com/news/-/how-does-spirit-differ-from-a-traditional-cms-like-wordpress-256/\" target=\"_blank\" rel=\"noopener\">Spirit</a>.",
      "description": ""
    },
    {
      "title": "Brand Impact Awards",
      "link": "https://web.archive.org/web/20170929043407/https://brandimpactawards.com/",
      "logo": "brandimpact",
      "summary": "A piece of work I am very fond of. An extremely responsie, beautifully made, dynamic website built on Spirit, a PHP-based CMS. Fully custom no frameworks or crutches.",
      "description": ""
    },
    {
      "title": "Malford of London",
      "link": "https://web.archive.org/web/20160331145150/http://www.malfordoflondon.com/",
      "logo": "malford",
      "summary": "My freelance client requested a series of pages to be built using Bootstrap, to be ported over to Wordpres. I was responsible for homepage, catalogue page, and individual product pages. Accent was made on full responsiveness and layour flexibility to look good at all times.",
      "description": ""
    }
  ],
  "projects": [
    {
      "title": "SVG Moscow metro map",
      "summary": "Heavily inspired by <a href=\"https://web.archive.org/web/20171121043855/http://www.csstubemap.co.uk/\" target=\"_blank\">csstubemap</a>, I thought that yes, HTML/CSS map is great idea, but on paper its completely unmanageable and unusable if you want to add any kind of data manipulation, sorting, shortest-path algorithms etc. After some research the only reasonable solution was SVG - a clean, clear, and elegant way of keeping the map maintainable without the hassle, its SEO friendly, its compliant with any standards, and its fully accessible to JS in a semantic and meaningful way, so data manipulation will be much more accessible and enjoyable task. I'm specifically interested in implementing <a href=\"https://en.wikipedia.org/wiki/A*_search_algorithm\" target=\"_blank\">A* search algorithm</a>"
    },
    {
      "title": "webGL 3D model manipulation",
      "summary": [
        "Apparently I have a surprising passion for browser games done right. Most of browser games you see today are flash based, and anything even remotely close to webGL and HTML5 Canvas implementation is either nonexistent or done poorly and can barely be called a game. There are a few pleasant exception though, <a href=\"https://playcanvas.com/\" target=\"_blank\">Play Canvas</a> and <a href=\"http://www.littleworkshop.fr/\" target=\"_blank\">Little workshop</a> being the most notable ones.",
        "I am exceedingly curious to play with this tech myself and see what I can do with this, how far can this be pushed, and even though JS is not an ideal language for expansive browser games - maybe a city management genre would fit it the best. So playing with a house model, setup its building order, 3D view and manipulation, hide/show individual elements etc. and maybe someday push it further than a single model."
      ]
    },
    {
      "title": "Pure CSS dynamic city",
      "summary": "Heavily inspired by <a href=\"http://codepen.io/stepan/pen/dfjDL\" target=\"_blank\">Tiny city</a>, and as a healthy (but very unmanageable) alternative to webGL, this seems like a curious thing to try - create a few buildings, preset conditions and flexible variables, and generate a city based on set parameters. Yes its fairly basic, but how amazing would be it to create an always unique HTML/CSS city with a press of a button!"
    },
    {
      "title": "Recreate Pillars of Eternity dialogue tree",
      "summary": "A while back I've read very thought provoking article <a href=\"https://medium.com/swlh/designing-musical-user-interfaces-4f30b41d7a83\" target=\"_blank\">Designing Musical User Interfaces</a>, I am not a designer, but it made me wonder when was the last time I used an audio file in my web development? In fact, was there even a first time? It seems baffling that such an obvious stimulus as sound is being completely ignored and even shunned in web development world. So I thought it would be an interesting experiment to combine a favourite characters dialogue - text and audio and interactions - with web development and audio files for an immersive experience. This will give me plenty of room to experiment with audio formats, and sound integration into a website."
    },
    {
      "title": "D3js family tree",
      "summary": "Recently I have dabbled with <a href=\"https://d3js.org/\" target=\"_blank\">D3js</a>, an amazing and very powerful library for data manipulation. A complex tool that gives huge control over data formatting, outputting and shaping it in any way imaginable. This coincided with my personal curiosity for my family tree and finding lost relatives - there turned out to be a whole lot of them. The best way to visualise them all, keep a record, and present all the research and work done to all of them is a tree diagram. A very familiar and widely accepted genealogy depiction tool, and with proper formatting and rich data it can be a gorgeous and impressive data showcase."
    }
  ]
}
